In [67]:
import pandas as pd
import numpy as np
import mysql.connector

## Read database using mysql.connector

In [5]:
dbku = mysql.connector.connect(
    host = "localhost",
    user = "root",
    passwd = "do708091Mysql",
    database = "pandas_tes"
)
q = "select * from employees"
df = pd.read_sql(q, dbku)
df

   id     nama              email               waktu
0   6   Asnawi    asnawi@yahoo.id 2019-12-09 09:29:16
1   7    Bagas  bagasadi@yahoo.id 2019-12-09 09:29:16
2   8     Evan    evandd@yahoo.id 2019-12-09 09:29:16
3   9  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:29:16

## New way to read database without mysql.connector

In [17]:
db_address = "mysql://root:do708091Mysql@localhost:3306/pandas_tes"
q = "select * from employees"
df = pd.read_sql(q, db_address)
df

   id     nama              email               waktu
0   6   Asnawi    asnawi@yahoo.id 2019-12-09 09:29:16
1   7    Bagas  bagasadi@yahoo.id 2019-12-09 09:29:16
2   8     Evan    evandd@yahoo.id 2019-12-09 09:29:16
3   9  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:29:16

## Read database using sql alchemy

In [12]:
import sqlalchemy as sqlac

In [21]:
q = "select * from employees"
engine = sqlac.create_engine(
    "mysql://root:do708091Mysql@localhost:3306/pandas_tes"
)
df = pd.read_sql(q, engine)
df

   id     nama              email               waktu
0   6   Asnawi    asnawi@yahoo.id 2019-12-09 09:29:16
1   7    Bagas  bagasadi@yahoo.id 2019-12-09 09:29:16
2   8     Evan    evandd@yahoo.id 2019-12-09 09:29:16
3   9  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:29:16

In [19]:
df = pd.read_sql(
    'employees', engine, columns=['nama']
)
df2 = pd.read_sql(
    'select nama, waktu from employees', engine
)

print(df)
print(df2)

      nama
0   Asnawi
1    Bagas
2     Evan
3  Osvaldo
      nama               waktu
0   Asnawi 2019-12-09 09:29:16
1    Bagas 2019-12-09 09:29:16
2     Evan 2019-12-09 09:29:16
3  Osvaldo 2019-12-09 09:29:16

## Playing with datetime64

In [20]:
df2.to_sql(
    name = 'daftar_karyawan',
    con = engine,
    if_exists = 'replace'
)

In [42]:
new_data = pd.DataFrame([
    {'id':5, 'nama':'Saddil', 'email': 'saddil@gmail.com', 'waktu':'2019-12-10 10:22:31'}
])
new_data['waktu'] = new_data['waktu'].astype('datetime64')
new_data

   id    nama             email               waktu
0   5  Saddil  saddil@gmail.com 2019-12-10 10:22:31

In [41]:
dfx = pd.read_sql_query(
    "select * from employees", engine, parse_dates = ['waktu'], 
#     index_col = 'waktu'
)
dfx

   id     nama              email               waktu
0   6   Asnawi    asnawi@yahoo.id 2019-12-09 09:29:16
1   7    Bagas  bagasadi@yahoo.id 2019-12-09 09:29:16
2   8     Evan    evandd@yahoo.id 2019-12-09 09:29:16
3   9  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:29:16

In [45]:
df_new = pd.concat([dfx, new_data], ignore_index=True)
df_new.set_index('waktu', inplace=True)
df_new

                     id     nama              email
waktu
2019-12-09 09:29:16   6   Asnawi    asnawi@yahoo.id
2019-12-09 09:29:16   7    Bagas  bagasadi@yahoo.id
2019-12-09 09:29:16   8     Evan    evandd@yahoo.id
2019-12-09 09:29:16   9  Osvaldo   osvaldo@yahoo.id
2019-12-10 10:22:31   5   Saddil   saddil@gmail.com

## Playing with TLKM Stock Database from 2014 - 2015

In [71]:
tlkm = pd.read_csv('TLK.csv', parse_dates=['Date'], index_col='Date')
# tlkm['Date'] = tlkm['Date'].astype('datetime64')
tlkm = tlkm.sort_index()
tlkm = tlkm.resample('D').sum()
tlkm.iloc[:,:5] = tlkm.iloc[:,:5].replace(0, np.NaN)
tlkm = tlkm.fillna(method='ffill', axis=0)
tlkm.head(20)

                 Open       High        Low      Close  Adj Close  Volume
Date
2014-12-08  22.605000  22.760000  22.075001  22.170000  18.561234  434000
2014-12-09  22.420000  23.270000  22.049999  22.799999  19.088684  345800
2014-12-10  22.910000  22.910000  22.500000  22.514999  18.850075  202600
2014-12-11  22.670000  22.790001  22.570000  22.670000  18.979845  367600
2014-12-12  22.660000  22.660000  22.150000  22.150000  18.544491  214800
2014-12-13  22.660000  22.660000  22.150000  22.150000  18.544491       0
2014-12-14  22.660000  22.660000  22.150000  22.150000  18.544491       0
2014-12-15  22.344999  22.344999  21.295000  21.520000  18.017040  584600
2014-12-16  21.465000  21.760000  21.145000  21.344999  17.870523  348800
2014-12-17  21.480000  22.040001  21.219999  21.750000  18.209600  423200
2014-12-18  22.360001  22.540001  22.165001  22.540001  18.871008  371000
2014-12-19  22.549999  22.665001  22.240000  22.285000  18.657515  456000
2014-12-20  22.549999  22.665001  22.240000  22.285000  18.657515       0
2014-12-21  22.549999  22.665001  22.240000  22.285000  18.657515       0
2014-12-22  22.580000  22.790001  22.420000  22.575001  18.900311  343000
2014-12-23  22.605000  22.674999  22.305000  22.334999  18.699375  307200
2014-12-24  22.650000  22.799999  22.580000  22.719999  19.021706  189400
2014-12-25  22.650000  22.799999  22.580000  22.719999  19.021706       0
2014-12-26  22.264999  22.815001  21.625000  22.760000  19.055193  232400
2014-12-27  22.264999  22.815001  21.625000  22.760000  19.055193       0